# FabricationSpotTopElevationIncludeInsulationOfPart Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ParameterTypeId..::..FabricationSpotTopElevationIncludeInsulationOfPart Property
ParameterTypeId Class See Also
---
"Spot Top Elevation with Insulation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationSpotTopElevationIncludeInsulationOfPart { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationSpotTopElevationIncludeInsulationOfPart As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationSpotTopElevationIncludeInsulationOfPart {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace